# 1. ვიქტორინა
# შეადგინე ვიქტორინის პროგრამა. მომხმარებელს უნდა დავუსვათ კითხვა: “რომელი იმპერიის მიერ აგებული წყალ-მომარაგების სისტემა (აკვედუკი) ფუნქციონირებს დღესაც?”
# სავარაუდო პასუხები:
# შუმერთა
# სელჩუკთა
# რომის
# მონღოლთა
# მომხმარებელმა უნდა შეიყვანოს სწორი პასუხის ნომერი ან თავად სწორი პასუხი.
# შეცდომის შემთხვევაში იბეჭდება:
# „არა! სწორი პასუხია რომის!“
# სწორი პასუხის შემთხვევაში იბეჭდება:
# „სწორია!“


print('''რომელი იმპერიის მიერ აგებული წყალ-მომარაგების სისტემა (აკვედუკი) ფუნქციონირებს დღესაც?
1) შუმერთა
2) სელჩუკთა
3) რომის
4) მონღოლთა
''')

while True:
    answer = input('გთხოვთ, შეიყვანოთ სწორი პასუხის ნომერი, ან თავად სწორი პასუხი: ')
    if answer=='3' or answer=='რომის':
        print('სწორია!')
        break
    else:
        print('არა! სწორი პასუხია რომის!')




# 2. ონლაინ მაღაზია
# პროგრამა გთავაზობს პროდუქტის სამ კატეგორიას.
# მაგ.
# ლეპტოპები
# პერსონალური კომპიუტერები
# მობილურები
# მომხმარებელი ირჩევს ერთ-ერთს.
# პროგრამა ითხოვს მაქსიმალურ ბიუჯეტს და ბიუჯეტის მიხედვით სთავაზობს მომხმარებელს კონკრეტულ მოდელს არჩეულ კატეგორიაში.
# (თითო კატეგორიაში მინიმუმ 3 პროდუქტი მაინც უნდა იყოს)
# თუ ბიუჯეტი ძალიან მცირეა, პროგრამა ბეჭდავს, რომ ამ თანხაში არ გააჩნია შემოთავაზება.

#######################################################################################################################

# აქ ციკლს კი დავწერ, უბრალოდ შინაარსობრივად ვერ ვხვდები სად უნდა დააბრეიქოს...
# იდეაში, ჩემი აზრით აქ ისეთი პროგრამა უნდა დაწერო, რომელიც არასდროს არ დააბრეიქებს...
# იმიტომ რომ იქნებ ბევჯერ მოუნდა მომხმარებელს კატეგორიისა და ბიუჯეტის მითითება...
# ყველგან შემიძლია ბრეიქის გამოყენება, მაგრამ ალბათ აჯობებს რომ არ დააბრეიქოს არსად...


while True:
    category=(input('''
    1) ლეპტოპი
    2) პერსონალური კომპიუტერი
    3) მობილური

    გთხოვთ, აირჩიოთ თქვენთვის სასურველი კატეგორიის ციფრი: '''))

    laptop=['Asus 11.6'' E210MA-GJ365', 'Lenovo IdeaPad Slim 5 16ABR8 (82XG004KRK)', ' Apple MacBook Air 13'' M1 (8GB/256GB']
    PC=['Lenovo IdeaCentre AIO 3 24IAP7 (F0GH00YRRK)', 'Asus AIO V241 23.8'' (V241EAK-WA150M)', 'Lenovo ThinkCentre neo 30a 27'' (12CB0020RU)']
    phone=['Xiaomi Redmi Note 13 Pro+ (8GB/256GB) 5G', 'Samsung Galaxy Flip4 5G (8GB/256GB)', 'Apple iPhone 15 Pro Max 256GB']

    if category == "1":
        budget1 = int(input('გთხოვთ, მიუთითოთ თქვენი ბიუჯეტი: '))
        if budget1>2000:
            print(f"""შემიძლია გირჩიოთ შემდეგი ლეპტოპები:
                    {laptop[0]},
                    {laptop[1]},
                    {laptop[2]}""")
        elif budget1 > 1000:
            print(f"""შემიძლია გირჩიოთ შემდეგი ლეპტოპები:
                    {laptop[0]},
                    {laptop[1]}""")
        elif budget1>500:
            print(f"""შემიძლია გირჩიოთ შემდეგი ლეპტოპები:
                    {laptop[0]}""")
        else:
            print('სამწუხაროდ, ამ თანხაში არ გამაჩნია შემოთავაზება')
        break
    elif category == "2":
        budget2 = int(input('გთხოვთ, მიუთითოთ თქვენი ბიუჯეტი: '))
        if budget2 >2500:
            print(f"""შემიძლია გირჩიოთ შემდეგი PC:
                    {PC[0]},
                    {PC[1]},
                    {PC[2]}""")
        elif budget2 > 1000:
            print(f"""შემიძლია გირჩიოთ შემდეგი PC:
                    {PC[0]},
                    {PC[1]}""")
        elif budget2 >800:
            print(f"""შემიძლია გირჩიოთ შემდეგი PC:
                    {PC[0]}""")
        else:
            print('სამწუხაროდ, ამ თანხაში არ გამაჩნია შემოთავაზება')
        break
    elif category == "3":
        budget3 = int(input('გთხოვთ, მიუთითოთ თქვენი ბიუჯეტი: '))
        if budget3 >2500:
            print(f"""შემიძლია გირჩიოთ შემდეგი მობილურები:
                    {phone[0]},
                    {phone[1]},
                    {phone[2]}""")
        elif budget3 >1500:
            print(f"""შემიძლია გირჩიოთ შემდეგი მობილურები:
                    {phone[0]},
                    {phone[1]}""")
        elif budget3 >600:
            print(f"""შემიძლია გირჩიოთ შემდეგი მობილური:
                    {phone[0]}""")
        else:
            print('სამწუხაროდ, ამ თანხაში არ გამაჩნია შემოთავაზება')
        break
    else:
        print('\nგთხოვთ მიუთითოთ სასურველი კატეგორია და თქვენი ბიუჯეტი!')

#######################################################################################################################

# 3. ქუესთის შედგენა (Text Based Adventure Game)
# დაწერე ერთმანეთში ჩასმული if-else კონსტრუქციების
# გამოყენებით მარტივი ტექსტზე დაფუძნებული სათავგადასავლო თამაში.
# მაგ. თავიდან პროგრამა ბეჭდავს მომხმარებლის ადგილსამყოფელს და სთავაზობს მქომედების რამდენიმე ვარიანტს. სხვადასხვა არჩევანის შემთხვევაში თამაშ სხვადასხვანაირად ვითარდება.


# აქაც, ჩემი აზრით არ სჭირდება თამაშს ციკლი...

print("\nმოგესალმებით ჩვენს თავგადასავალში!")

# საწყისი პოზიცია
print("\nიღვიძებ ბნელ ოთახში და არ გახსოვს როგორ მოხვდი აქ.")
print("შენ წინ სამი კარია: A, B და C.")

# მოთამაშე ირჩევს კარს
door_choice = input("რომელ კარს ირჩევ? (A/B/C): ")

if door_choice.upper() == "A":
    print("\nაღებ კარს და ტყეში აღმოჩნდები.")
    print("შენ უკან რაღაც უცნაური ხმა გესმის.")
    action = input("მობრუნდები? (კი/არა): ")
    if action == "კი":
        print("\nბრუნდები და ხედავ, რომ დათვი მორბის შენკენ!")
        print("ცდილობ რომ გაიქცე, მაგრამ დათვი გეწევა და...")
        print("თამაში დასრულდა! თავს დაგესხა დათვი.")
    else:
        print("\n შენ წყვეტ რომ არ მოტრიალდე და წინ ფრთხილად გააგრძელო გზა.")
        print("საბოლოოდ იპოვე ტყიდან გამავალი ბილიკი.")
        print("გილოცავთ! თქვენ გააღწიეთ ტყიდან.")

elif door_choice.upper() == "B":
    print("\nკარს აღებ და მიწისქვეშეთში აღმოჩნდი.")
    print("მიწაზე გასაღები დევს.")
    action = input("გასაღებს აიღებ? (კი/არა): ")
    if action == "კი":
        print("\nიღებ გასაღებს და ჩაკეტილ კარს ამჩნევ ახლოს.")
        print("გასაღების გამოყენებით კარს აღებ და თავს აღწევ მიწისქვეშეთიდან.")
        print("გილოცავთ!")
    else:
        print("\nგასაღებს მიწაზე ტოვებ და აგრძელებ სიარულს.")
        print("სამწუხაროდ, გასასვლელს ვერ პოულობ.")
        print("თამაში დასრულდა! სამუდამოდ რჩები დამწყვდეული.")

elif door_choice.upper() == "C":
    print("\nკარს აღებ და ბიბლიოთეკაში აღმოჩნდი.")
    print("აქ წიგნებით სავსე თაროა")
    action = input("წიგნის კითხვას იწყებ? (კი/არა): ")
    if action == "კი":
        print("\nწიგნის კითხვას იწყებ და დროის გასვლას ვერ გრძნობ.")
        print("რამდენიმე საათი გავიდა და ხვდები, რომ ბიბლიოთეკა იხურება.")
        print("ცდილობ იპოვო გასასვლელი, მაგრამ ის არსად არ ჩანს.")
        print("თამაში დასრულდა! სამუდამოდ რჩები დამწყვდეული ბიბლიოთეკაში")
    else:
        print("\nწიგნს არ კითხულობ და ცდილობ ბიბლიოთეკიდან გაღწევას.")
        print("შენ იპოვე უკანა გასასვლელი.")
        print("გილოცავთ! თქვენ მშვიდობით გააღწიეთ ბიბლიოთეკიდან.")
else:
    print("\nარასწორი არჩევანი! გაურკვევლად დგახარ.")
    print("მოულოდნელად, შენ ქვემოთ მიწა იხსნება და ვარდები უძირო ორმოში.")
    print("თამაში დასრულდა! შენ სამუდამოდ დაიკარგე.")

####################################################################################################################

# 4. კარიერის შემრჩევი (არასავალდებულო დავალება)
# პროგრამა უსვამს მომხმარებელს რამდენიმე კითხვას
# (თქვენი იმპროვიზაციით) და ურჩევს მისთვის შესაფერის
# პროფესიას.

#აქაც ჩემი აზრით არ სჭირდება ციკლში ჩასმა


print("\nმოგესალმებით კარიერის შემრჩევ პროგრამაში!")

print("\nმოდით შევარჩიოთ თქვენთვის შესაფერისი კარიერა.")

name = input("თქვენი სახელი: ")

print(f"\nსასიამოვნოა თქვენი გაცნობა, {name}!")

print("\nგთხოვთ, შემდეგ შეკითხვებს უპასუხოთ ან 'კი' ან 'არა'-თი.")

while True:
    question_1 = input("\nმოგწონთ მონაცემებთან მუშაობა და მათემატიკური ამოცანების გადაჭრა?: ")
    question_2 = input("დაინტერესებული ხართ თუ არა ტექნოლოგიებითა და კომპიუტერებით?: ")
    question_3 = input("მოგწონთ სხვების დახმარება და მათზე ზრუნვა?: ")
    question_4 = input("გაქვთ კრეატიული აზროვნება და მოგწონთ საკუთარი აზრის გამოხატვა?: ")


    if question_1 == "კი" and question_2 == "კი" and question_3 == "არა" and question_4 == "არა" or question_1 == "კი" and question_2 == "არა" and question_3 == "არა" and question_4 == "არა" or question_1 == "არა" and question_2 == "კი" and question_3 == "არა" and question_4 == "არა":
        print("\nთქვენს პასუხებზე დაყრდნობით, ჩვენ გირჩევთ პროგრამისტისა ან მონაცემთა ანალიტიკოსის პროფესიას.")
        break
    elif question_1 == "არა" and question_2 == "არა" and question_3 == "კი" and question_4 == "არა":
        print("\nთქვენს პასუხებზე დაყრდნობით, ჩვენ გირჩევთ კარიერას ჯანდაცვის სფეროში, როგორიცაა მედდობა ან ფსიქოლოგია.")
        break
    elif question_1 == "არა" and question_2 == "არა" and question_3 == "არა" and question_4 == "კი":
        print("\nთქვენს პასუხებზე დაყრდნობით, ჩვენ გირჩევთ მხატვრის, მწერლის, გრაფიკული დიზაინერისა ან მუსიკოსის პროფესიებს.")
        break
    elif question_1 == "არა" and question_2 == "არა" and question_3 == "არა" and question_4 == "არა":
        print("\nთქვენს პასუხებზე დაყრდნობით, ჩვენ გირჩევთ, რომ ჯერ კარგად დაფიქრდეთ საკუთარ ინტერესებზე.")
        break
    elif question_1 != "კი" or "არა" and question_2 != "კი" or "არა" and question_3 != "კი" or "არა" and question_4 != "კი" or "არა":
        print("\nგთხოვთ, დააფიქსიროთ თქვენი აზრი ყველა შეკითხვაზე.")
    else:
        print("\nჩანს, რომ თქვენ გაქვთ მრავალმხრივი ინტერესები. უმჯობესია თუ შეისწავლით ისეთ პროფესიას, რომელიც იძლევა მრავალფეროვნებისა და შემოქმედების საშუალებას.")
        break




