# # 1. შექმენი ფუნქცია, რომელიც მომხმარებლისგან მიღებულ ინფორმაციას გაასამმაგებს
# # და დაბეჭდავს შემდეგნაირად:
# # input: “word”
# # Output: „Tripled: wordwordword“


def tripled():
    a = input("შეიყვანეთ ინფორმაცია: ")
    b = a*3
    print("Tripled: ", b)
tripled()

#
# # 2. შექმენი ფუნქცია, რომელიც მიიღებს მომხმარებლის წონას და დააბრუნებს მის წონას
# # მთვარეზე. (მთვარის გრავიტაცია 6_ჯერ ნაკლებია დედამიწისაზე)


def weight_on_the_moon():
    while True:
        a = input("\nშეიყვანეთ თქვენი წონა: ")
        try:
            a = int(a)
        except ValueError:
            print("გთხოვთ შეიყვანოთ რიცხვითი მონაცემი")
            continue

        b = a / 6
        print('თქვენი წონა მთვარეზე:', b, "კგ")
        break

weight_on_the_moon()


#######################################################################################################################

# # 3. შექმენი კალკულატორის ფუნქცია, რომელიც მიიღებს გამოსახულებას
# # მომხმარებლისგან input() ფუნქციის დახმარებით (სამ მონაცემს _ პირველ რიცხვს,
# # მოქმედებას (+ - * / ^), მეორე რიცხვს)
# # მაგ. „2 * 6“ დათვლის და დააბრუნებს შედეგს. გაითვალისწინე რომ რიცხვის შეყვანის
# # მაგიერ სიმბოლოების შეყვანის შემთხვევაში უნდა დააბრუნოს ფუნქციამ შესაბამისი
# # მესიჯი. ასევე ნულზე გაყოფა არ შეიძ₾ება, ამ შემთხვევაშიც უნდა დააბრუნოს
# # შესაბამისი მესიჯი. (დააბრუნოს და არა დაპრინტოს)



############### პირველი ვარიანტი პრინტებით და ციკლით##########
def calculator():
    while True:
        a = input('\nშეიყვანეთ პირველი რიცხვი: ')
        b = input("შეიყვანეთ მოქმედება (+ - * / ^): ")
        c = input('შეიყვანეთ მეორე რიცხვი: ')

        try:
            a = int(a)
            c = int(c)
        except ValueError:
            print("გთხოვთ შეიყვანოთ რიცხვითი მონაცემი")
            continue

        if b == '+':
            print(a + c)
            break
        elif b == '-':
            print(a - c)
            break
        elif b == '*':
            print(a * c)
            break
        elif b == '/':
            if c == 0:
                print('ნულზე გაყოფა არ შეიძლება')
            else:
                print(a / c)
                break
        elif b == '^':
            print(a ** c)
            break
        else:
            print('''მსგავსი ოპერაცია ჩემს კალკულატორში არ სრულდება. 
გთხოვთ შეიყვანოთ შემდეგი მოქმედებებისგან ერთ-ერთი (+ - * / ^)''')

calculator()


###################მეორე ვარიანტი რეთარნებითა და ციკლის გარეშე:#######################

def calculator():
    a = input('შეიყვანეთ პირველი რიცხვი: ')
    b = input("შეიყვანეთ მოქმედება (+ - * / ^): ")
    c = input('შეიყვანეთ მეორე რიცხვი: ')

    try:
        a = int(a)
        c = int(c)
    except ValueError:
        return "გთხოვთ შეიყვანოთ რიცხვითი მონაცემი"

    if b == '+':
        return a + c

    elif b == '-':
        return a - c

    elif b == '*':
        return a * c

    elif b == '/':
        if c == 0:
            return 'ნულზე გაყოფა არ შეიძლება.'
        else:
            return a / c

    elif b == '^':
        return a ** c

    else:
        return '''მსგავსი ოპერაცია ჩემს კალკულატორში არ სრულდება.
გთხოვთ შეიყვანოთ შემდეგი მოქმედებებისგან ერთ-ერთი (+ - * / ^)'''

print(calculator())

